9. working with date values

In [63]:
import pandas as pd

In [64]:
df = pd.DataFrame({
    "Name": ["Aman","Riya","Kunal","Sneha"],
    "DOJ": ['2024-01-01', '2024-01-15', '2024-03-28', '2024-03-03'],
    "Marks": [78,85,90,70]
})

In [65]:
df["DOJ"].dtype

dtype('O')

In [66]:
df["DOJ"] = pd.to_datetime(df["DOJ"])
df["DOJ"].dtype

dtype('<M8[ns]')

In [67]:
# Handling different date formats
df["DOB"] = ["21-10-2002", '22-11-2000','28-09-2003','02-12-2005']
df["DOB"] = pd.to_datetime(df["DOB"],format="%d-%m-%Y")
df

    Name        DOJ  Marks        DOB
0   Aman 2024-01-01     78 2002-10-21
1   Riya 2024-01-15     85 2000-11-22
2  Kunal 2024-03-28     90 2003-09-28
3  Sneha 2024-03-03     70 2005-12-02

In [68]:
# Extract parts of date (Year, Month, Dayâ€¦)
df["Year"] = df["DOJ"].dt.year
df["Month"] = df["DOJ"].dt.month
df["Day"] = df["DOJ"].dt.day
df

    Name        DOJ  Marks        DOB  Year  Month  Day
0   Aman 2024-01-01     78 2002-10-21  2024      1    1
1   Riya 2024-01-15     85 2000-11-22  2024      1   15
2  Kunal 2024-03-28     90 2003-09-28  2024      3   28
3  Sneha 2024-03-03     70 2005-12-02  2024      3    3

In [69]:
# df["DOJ"].dt.day_name()
# df["DOJ"].dt.month_name()

In [70]:
# Date-based filtering (VERY IMPORTANT)
# Filter data after a specific date
print(df[df["DOJ"] > "2024-01-20"])

    Name        DOJ  Marks        DOB  Year  Month  Day
2  Kunal 2024-03-28     90 2003-09-28  2024      3   28
3  Sneha 2024-03-03     70 2005-12-02  2024      3    3

In [71]:
# Filter between two dates
df[(df["DOB"]>= "2002-12-29") & (df["DOB"]<="2004-10-30")]

    Name        DOJ  Marks        DOB  Year  Month  Day
2  Kunal 2024-03-28     90 2003-09-28  2024      3   28

In [72]:
# Current Date & Time
pd.Timestamp.now()

Timestamp('2026-01-30 21:20:36.034776')

In [73]:
pd.Timestamp.today().date() #only date

datetime.date(2026, 1, 30)

In [74]:
# Difference between two dates (Time Delta)
df["Date_of_prize"] =  pd.Timestamp("2025-12-30") - df["DOJ"]
df

    Name        DOJ  Marks        DOB  Year  Month  Day Date_of_prize
0   Aman 2024-01-01     78 2002-10-21  2024      1    1      729 days
1   Riya 2024-01-15     85 2000-11-22  2024      1   15      715 days
2  Kunal 2024-03-28     90 2003-09-28  2024      3   28      642 days
3  Sneha 2024-03-03     70 2005-12-02  2024      3    3      667 days

In [75]:
# Sorting by Date (common use)
df.sort_values(by="DOJ",inplace=True)
df.reset_index(drop=True,inplace=True)
df

    Name        DOJ  Marks        DOB  Year  Month  Day Date_of_prize
0   Aman 2024-01-01     78 2002-10-21  2024      1    1      729 days
1   Riya 2024-01-15     85 2000-11-22  2024      1   15      715 days
2  Sneha 2024-03-03     70 2005-12-02  2024      3    3      667 days
3  Kunal 2024-03-28     90 2003-09-28  2024      3   28      642 days

In [76]:
# Set Date as Index (ADVANCE but IMPORTANT)
# df.set_index("Date", inplace=True)
# df.loc["2024-01"]

In [77]:
# Handling different date formats
dates = ["10-01-2024", "15-01-2024"]
pd.to_datetime(dates, dayfirst=True)

DatetimeIndex(['2024-01-10', '2024-01-15'], dtype='datetime64[ns]', freq=None)